In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

import warnings
warnings.filterwarnings('ignore')

In [2]:
np.nan

nan

In [3]:
name = ["john","jack","jill","kenny","kevin"]
math = [89,78,67,np.nan,85]
science = [78,75,np.nan,np.nan,76]

In [4]:
dic = {"name":name,"math":math,"science":science}

In [5]:
df = pd.DataFrame(dic)

In [6]:
df

    name  math  science
0   john  89.0     78.0
1   jack  78.0     75.0
2   jill  67.0      NaN
3  kenny   NaN      NaN
4  kevin  85.0     76.0

In [7]:
df.isnull()

    name   math  science
0  False  False    False
1  False  False    False
2  False  False     True
3  False   True     True
4  False  False    False

In [8]:
df.isnull().sum()

name       0
math       1
science    2
dtype: int64

In [9]:
df.dropna()

    name  math  science
0   john  89.0     78.0
1   jack  78.0     75.0
4  kevin  85.0     76.0

In [10]:
df.dropna(axis=1)

    name
0   john
1   jack
2   jill
3  kenny
4  kevin

In [11]:
df.dropna(thresh=2)

    name  math  science
0   john  89.0     78.0
1   jack  78.0     75.0
2   jill  67.0      NaN
4  kevin  85.0     76.0

In [12]:
df.dropna(subset=["name","math"])

    name  math  science
0   john  89.0     78.0
1   jack  78.0     75.0
2   jill  67.0      NaN
4  kevin  85.0     76.0

In [13]:
df.dropna(subset=["science","math"])

    name  math  science
0   john  89.0     78.0
1   jack  78.0     75.0
4  kevin  85.0     76.0

In [14]:
df.drop(0)

    name  math  science
1   jack  78.0     75.0
2   jill  67.0      NaN
3  kenny   NaN      NaN
4  kevin  85.0     76.0

In [15]:

df.drop([0,2])

    name  math  science
1   jack  78.0     75.0
3  kenny   NaN      NaN
4  kevin  85.0     76.0

In [16]:
df.drop(["name","math"],axis=1)

   science
0     78.0
1     75.0
2      NaN
3      NaN
4     76.0

Replacing missing values

In [17]:
df

    name  math  science
0   john  89.0     78.0
1   jack  78.0     75.0
2   jill  67.0      NaN
3  kenny   NaN      NaN
4  kevin  85.0     76.0

In [18]:
df.fillna(0)

    name  math  science
0   john  89.0     78.0
1   jack  78.0     75.0
2   jill  67.0      0.0
3  kenny   0.0      0.0
4  kevin  85.0     76.0

In [19]:
df.fillna(method="ffill")

    name  math  science
0   john  89.0     78.0
1   jack  78.0     75.0
2   jill  67.0     75.0
3  kenny  67.0     75.0
4  kevin  85.0     76.0

In [21]:
df["math"].mean()

79.75

In [23]:
df["science"].mean()

76.33333333333333

In [24]:
df["math"].fillna(76.75)

0    89.00
1    78.00
2    67.00
3    76.75
4    85.00
Name: math, dtype: float64

In [25]:
df["science"].fillna(76.33)

0    78.00
1    75.00
2    76.33
3    76.33
4    76.00
Name: science, dtype: float64

In [26]:
df["math"].fillna(76.75,inplace=True)

In [27]:
df["science"].fillna(76.33,inplace=True)

In [28]:

df

    name   math  science
0   john  89.00    78.00
1   jack  78.00    75.00
2   jill  67.00    76.33
3  kenny  76.75    76.33
4  kevin  85.00    76.00

In [29]:
df = pd.read_csv("cars.csv")

In [32]:
df.head()

,symboling,normalized-losses,make,fuel-type,body-style,drive-wheels,engine-location,width,height,engine-type,engine-size,horsepower,city-mpg,highway-mpg,price
0,3,?,alfa-romero,gas,convertible,rwd,front,64.1,48.8,dohc,130,111,21,27,13495
1,3,?,alfa-romero,gas,convertible,rwd,front,64.1,48.8,dohc,130,111,21,27,16500
2,1,?,alfa-romero,gas,hatchback,rwd,front,65.5,52.4,ohcv,152,154,19,26,16500
3,2,164,audi,gas,sedan,fwd,front,66.2,54.3,ohc,109,102,24,30,13950
4,2,164,audi,gas,sedan,4wd,front,66.4,54.3,ohc,136,115,18,22,17450

In [33]:
df.isnull().sum()

symboling            0
normalized-losses    0
make                 0
fuel-type            0
body-style           0
drive-wheels         0
engine-location      0
width                0
height               0
engine-type          0
engine-size          0
horsepower           0
city-mpg             0
highway-mpg          0
price                0
dtype: int64

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205 entries, 0 to 204
Data columns (total 15 columns):
symboling            205 non-null int64
normalized-losses    205 non-null object
make                 205 non-null object
fuel-type            205 non-null object
body-style           205 non-null object
drive-wheels         205 non-null object
engine-location      205 non-null object
width                205 non-null float64
height               205 non-null float64
engine-type          205 non-null object
engine-size          205 non-null int64
horsepower           205 non-null object
city-mpg             205 non-null int64
highway-mpg          205 non-null int64
price                205 non-null int64
dtypes: float64(2), int64(5), object(8)
memory usage: 24.1+ KB

In [36]:
df["normalized-losses"].value_counts()

?      41
161    11
91      8
150     7
134     6
104     6
128     6
94      5
102     5
168     5
103     5
95      5
65      5
85      5
74      5
148     4
106     4
122     4
93      4
118     4
115     3
83      3
101     3
137     3
125     3
154     3
188     2
81      2
197     2
87      2
164     2
194     2
145     2
113     2
192     2
110     2
153     2
119     2
129     2
158     2
89      2
108     2
90      1
186     1
78      1
142     1
256     1
231     1
107     1
121     1
77      1
98      1
Name: normalized-losses, dtype: int64

In [37]:
df["horsepower"].value_counts()

68     19
70     11
69     10
116     9
110     8
95      7
114     6
88      6
101     6
160     6
62      6
102     5
76      5
97      5
145     5
82      5
84      5
86      4
111     4
123     4
92      4
207     3
152     3
90      3
85      3
182     3
121     3
73      3
155     2
52      2
?       2
112     2
184     2
162     2
94      2
176     2
100     2
161     2
156     2
56      2
55      1
154     1
106     1
288     1
64      1
140     1
115     1
48      1
142     1
58      1
120     1
135     1
72      1
200     1
175     1
134     1
78      1
262     1
143     1
60      1
Name: horsepower, dtype: int64

In [39]:
df["horsepower"].replace("?",np.nan,inplace=True)

In [40]:
df["horsepower"] = df["horsepower"].astype(float)

In [41]:
df["horsepower"].fillna(df["horsepower"].mean(),inplace=True)

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205 entries, 0 to 204
Data columns (total 15 columns):
symboling            205 non-null int64
normalized-losses    205 non-null object
make                 205 non-null object
fuel-type            205 non-null object
body-style           205 non-null object
drive-wheels         205 non-null object
engine-location      205 non-null object
width                205 non-null float64
height               205 non-null float64
engine-type          205 non-null object
engine-size          205 non-null int64
horsepower           205 non-null float64
city-mpg             205 non-null int64
highway-mpg          205 non-null int64
price                205 non-null int64
dtypes: float64(3), int64(5), object(7)
memory usage: 24.1+ KB